{
  "Navbar": {
    "cv": "Course of Life",
    "aboutMe": "About Me"
  },
  "Blog": {
    "welcomeTitle": "Welcome to the my blog",
    "welcomeDescription": "Bu blogda kendi klavyemden dökülen yazıları bulacaksınız. Sosyal medya butonlarıyla kolayca paylaşabilir, yorumlarınızı benimle paylaşabilirsiniz. Keyifli okumalar!",
    "sideBar": {
      "allArticles": "All Articles"
    }
  },
  "HomePage": {
    "heroSection": {
      "titles": {
        "0": "Frontend Web Developer",
        "1": "Technology Enthusiast",
        "2": "Military History and Technology Aficionado",
        "3": "Goal-Oriented Visionary",
        "4": "Eager to Deepen Knowledge"
      },
      "bodyText": "Successful web development in today's world requires much more than just writing good code. Fast, aesthetic, and user-friendly interfaces are among the most critical elements shaping a business's digital identity. My goal is to deliver meticulously designed web solutions that are both visually appealing and functional, using modern technologies. I'm here to create impactful projects by utilizing the web technologies of the future today."
    },
    "experiences": {
      "title": "My Experiences",
      "list": {
        "inovathings": {
          "title": "Inovathings",
          "description": "My experience here was very influential in laying my foundation. It was during the pre-pandemic period when I grasped the basics of ReactJS and CSS. I completed the design of several web pages here and transferred the designs to websites. I also made minor code and page optimizations.",
          "period": "03/2021 – 04/2021"
        },
        "baykar": {
          "title": "Baykar Technologies",
          "description": "This was the period when I completed my mandatory internship, had a great time, and for the first time in my life, attended Teknofest. I worked diligently to complete the tasks assigned to me. I learned the intricacies of developing a project from scratch and working in a well-established company. The foundational experiences I gained and the people I spent time with during this period will always hold a special place in my life.",
          "period": "08/2023 – 10/2023"
        },
        "1likte": {
          "title": "1likte E-Commerce Platform",
          "description": "This was an e-commerce system I joined during university with the intention of gaining experience. Even after graduating, I worked tirelessly with a very small team to bring it to life. Despite being based on a startup, the project it attempted to implement and present was a comprehensive system that most companies today do not have. I managed all functionalities of 3 projects here. I took sole responsibility for meeting all design and system needs. A significant portion of my current experience stems from my dedicated and determined work here.",
          "period": "11/2021 – 12/2024"
        }
      },
      "soon": "Much more is coming soon..."
    },
    "technologies": "My Core Technologies",
    "expertises": "Concepts I Master",
    "offerArea": {
      "title": "How can I contribute to you?",
      "description": "With my personality and experiences that I believe are built on a solid foundation:",
      "areas": {
        "1": {
          "title": "I am a Strong Link in Teamwork",
          "description": "I always prioritize the value of teamwork. My experiences have taught me the importance of working harmoniously with team members to achieve the best results. Communication, collaboration, and mutual support are indispensable to me."
        },
        "2": {
          "title": "I am Focused on Continuous Learning and Development",
          "description": "There is no limit to learning! I enjoy developing myself not only in my area of expertise but also in other disciplines. I remain open to technological innovations and see every new piece of knowledge as an opportunity."
        },
        "3": {
          "title": "I Pay Attention to Detail",
          "description": "I know that the perfect result is hidden in small details made with the right decisions. My priority in projects is to enrich the user experience by paying attention to these details."
        },
        "4": {
          "title": "I Have a Proactive and Entrepreneurial Approach",
          "description": "I am not afraid to generate ideas and take action. I contribute to the fast progress of projects by taking initiative in areas where needed. I am solution-oriented and do not hesitate to take steps that simplify tasks."
        },
        "5": {
          "title": "I Care About Pixel-Perfect Design",
          "description": "To bring a website's design to life exactly as it is, I pay great attention to the planning and implementation stages. I establish the perfect balance between visual appeal and functionality."
        },
        "6": {
          "title": "I am Skilled in Problem Solving",
          "description": "I see encountered problems as opportunities. Every mistake is an experience. I analyze problems deeply and provide quick and permanent solutions. My solution-oriented approach helps projects progress without interruptions."
        }
      }
    },
    "quickStart": {
      "title": "Let's Create <gradient>Great Web Systems</gradient> Together",
      "description": "Do you have any questions? Or do you have a great idea we could work on together? Get in touch with me, and I'd be happy to assist you.",
      "getInTouch": "Get in Touch"
    }
  },
  "404": {
    "title": "Page Not Found",
    "description": "It seems like you've gotten lost. You can return to the main page before you get further lost, or enjoy the view of this amazing space scenery.",
    "backToMainPage": "Back to Main Page",
    "lookView": "Enjoy the View"
  },
  "LanguageSwitcher": {
    "label": "Change Language",
    "locale": "{locale, select, tr {🇹🇷 Turkish} en {🇺🇸 English} other {Unknown}}"
  },
  "ThemeChanger": {
    "system": "System",
    "dark": "Dark",
    "light": "Light"
  },
  "Common": {
    "loading": "Loading...",
    "backToTop": "Back to Top"
  }
}
