{
  "Navbar": {
    "cv": "Özgeçmiş",
    "aboutMe": "Hakkımda"
  },
  "Blog": {
    "welcomeTitle": "Kişisel Bloguma Hoş Geldiniz",
    "welcomeDescription": "Yakın zamanda burada kendi klavyemden dökülen, çeşitli konularda yazılmış blog yazıları bulacaksınız. Şu an yapım aşamasında.",
    "sideBar": {
      "allArticles": "Bütün Makaleler"
    }
  },
  "HomePage": {
    "heroSection": {
      "titles": {
        "0": "Web Ön Yüz Yazılım Geliştirici",
        "1": "Teknoloji Tutkunu",
        "2": "Askeri Tarih ve Teknoloji Meraklısı",
        "3": "Hedef Odaklı Vizyon",
        "4": "Bilgiyi Derinleştirmeye Açık"
      },
      "bodyText": "Günümüz dünyasında başarılı bir web geliştirme, sadece iyi kod yazmaktan çok daha fazlasını gerektiriyor. Hızlı, estetik ve kullanıcı dostu arayüzler, bir işletmenin dijital kimliğini şekillendiren en önemli unsurlar arasında. Amacım, modern teknolojileri kullanarak her detayı özenle tasarlanmış, hem göz alıcı hem de işlevsel web çözümleri sunmak. Geleceğin web teknolojilerini bugünden kullanarak, fark yaratan projeler için buradayım."
    },
    "experiences": {
      "title": "Deneyimlerim",
      "list": {
        "inovathings": {
          "title": "Inovathings",
          "description": "Buradaki deneyimim temel atmamda çok etkili oldu. Pandemi öncesi ReactJS ve CSS'in temellerini kavradığım zamanlardı. Burada birkaç web sayfasının tasarımını tamamladım. Tasarımları web sitelerine aktardım. Çok küçük çaplı kod ve sayfa optimizasyonları da yaptım.",
          "period": "03/2021 – 04/2021"
        },
        "baykar": {
          "title": "Baykar Teknoloji",
          "description": "Zorunlu stajımı yaptığım, çok güzel zaman geçirdiğim ve hayatımda ilk defa Teknofest'e gitmeme vesile olan bir dönem. Burada bana verilen görevleri titizlikle tamamlamaya çalıştım. Sıfırdan proje geliştirme ve köklü bir firmada çalışmanın inceliklerini öğrendim. Elde ettiğim temel deneyimler ve beraber zaman geçirdiğim bütün insanların hayatımda özel bir yeri olacak.",
          "period": "08/2023 – 10/2023"
        },
        "1likte": {
          "title": "1likte E-Ticaret Platformu",
          "description": "Üniversitedeyken deneyim kazanayım düşüncesiyle girdiğim, mezun olduktan sonra bile yılmadan çok çalışarak çok küçük bir ekiple yola koyulduğumuz bir e-ticaret sistemi. Startup temelinde de olsa yapmaya çalıştığı, ortaya koyduğu proje günümüz çoğu şirketinde yer almayan bir sistem bütünü. Burada 3 projenin bütün işlevlerini yürüttüm. Gerek tasarımsal gerek sistemsel bütün ihtiyaçların giderilmesinde tek başıma sorumluluk alarak yürüttüm. Mevcut deneyimlerimin çok büyük bir kısmını buradaki özverili ve azimli çalışmam ile elde ettim.",
          "period": "11/2021 – 12/2024"
        }
      },
      "soon": "Çok daha fazlası yakında..."
    },
    "techStack": {
      "title": "Teknoloji Yığınım",
      "programmingLanguages": "Programlama Dilleri",
      "frameworks": "Frameworkler",
      "styleTools": "Stil Araçları",
      "containerization": "Konteynerleştirme",
      "apiRequests": "API/Backend",
      "testing": "Test & Kalite Kontrol",
      "ides": "IDE'ler",
      "versionControlSystem": "Versiyon Kontrol Sistemi",
      "ai": "Yapay Zeka",
      "libraries": "Kütüphaneler",
      "cms": "İçerik Yönetim Sistemi",
      "cloudPlatform": "Bulut Platformu"
    },
    "expertises": "Hakim Olduğum Kavramlar",
    "offerArea": {
      "title": "Size nasıl katkı sağlayabilirim?",
      "description": "Sağlam bir temel üzerine inşa ettiğimi düşündüğüm kişiliğim ve deneyimlerim ile:",
      "areas": {
        "1": {
          "title": "Ekip Çalışmasında Güçlü Bir Halkayım",
          "description": "Ekip çalışmasının değerini her zaman ön planda tutarım. Tecrübelerim, takım üyeleriyle uyumlu çalışarak en iyi sonuçları elde etmenin önemini bana öğretti. İletişim, işbirliği ve karşılıklı destek benim için vazgeçilmezdir."
        },
        "2": {
          "title": "Sürekli Öğrenme ve Gelişim Odaklıyım",
          "description": "Bilgi öğrenmenin sınırı yok! Sadece uzmanlık alanımla değil, farklı disiplinlerde de kendimi geliştirmekten keyif alırım. Teknolojik yeniliklere açık bir şekilde, her yeni bilgiyi bir fırsat olarak görürüm."
        },
        "3": {
          "title": "Detaylara Önem Veririm",
          "description": "Mükemmel bir sonucun, doğru kararlarla alınmış küçük detaylarda saklı olduğunu biliyorum. Projelerde bu detaylara dikkat ederek kullanıcı deneyimini zenginleştirmek önceliğimdir."
        },
        "4": {
          "title": "Proaktif ve Girişimci Bir Yaklaşıma Sahibim",
          "description": "Fikir üretmekten çekinmem ve harekete geçerim. İhtiyaç duyulan alanlarda inisiyatif alarak projelerin hızlı ilerlemesine katkı sağlarım. Çözüm odaklıyım ve işleri kolaylaştıran adımları atmaktan çekinmem."
        },
        "5": {
          "title": "Pixel Perfect Tasarımı Önemsiyorum",
          "description": "Bir web sitesinin, tasarımının aynısını hayata geçirebilmek için planlama ve uygulama aşamalarında büyük bir özen gösteririm. Görsellik ve işlevsellik arasında mükemmel dengeyi kurarım."
        },
        "6": {
          "title": "Problem Çözmede Yetkinim",
          "description": "Karşılaşılan sorunları birer fırsat olarak görürüm. Her hata bir deneyimdir. Sorunları derinlemesine analiz ederek hızlı ve kalıcı çözümler üretirim. Çözüm odaklı yaklaşımım, projelerin kesintisiz ilerlemesine yardımcı olur."
        }
      }
    },
    "quickStart": {
      "title": "Birlikte <gradient>Harika Web Sistemlerine</gradient> İmza Atalım",
      "description": "Sorularınız mı var? Ya da birlikte çalışabileceğimiz güzel fikriniz mi var? Benimle iletişime geçin, size yardımcı olmaktan mutluluk duyarım.",
      "getInTouch": "İletişime Geç"
    }
  },
  "404": {
    "title": "Aradığın sayfa bulunamadı",
    "description": "Görüşüne göre kaybolmuşa benziyorsun. Daha fazla kaybolmadan ana sayfaya dönebilirsin ya da bu muazzam uzay manzarasının tadını çıkarabilirsin.",
    "backToMainPage": "Anasayfaya Dön",
    "lookView": "Manzaranın Tadını Çıkar"
  },
  "LanguageSwitcher": {
    "label": "Dil Değiştir",
    "locale": "{locale, select, tr {🇹🇷 Türkçe} en {🇺🇸 İngilizce} other {Unknown}}"
  },
  "ThemeChanger": {
    "system": "Sistem",
    "dark": "Koyu",
    "light": "Açık"
  },
  "Common": {
    "loading": "Yükleniyor...",
    "backToTop": "Başa Dön"
  }
}
